Задача 10: Напишите программу, которая принимает на вход трёхзначное
число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1

CODE

 int num1 = Convert.ToInt32(Console.ReadLine());
        int med = 0;
        if (num1 > 0)
        {
            num1 = (num1 / 10)%10;
        }
        Console.WriteLine(num1);



Задача 13: Напишите программу, которая выводит третью цифру
заданного числа или сообщает, что третьей цифры нет.

645 -> 5
78 -> третьей цифры нет
32679 -> 6

CODE

int num1 = Convert.ToInt32(Console.ReadLine());

        if (num1 >= 100) 
        {
            num1 = num1 / 10 % 10;
            Console.WriteLine(num1);

        }
        else
        {
            Console.WriteLine("NO");
        }






Задача 15: Напишите программу, которая принимает на вход цифру? 
обозначающую день недели, и проверяет, является ли этот день выходным


int DayOfWeek = Convert.ToInt32(Console.ReadLine());
        int Monday = 1;
        int Tuesday = 2;
        int Wednesday = 3;
        int Thursday = 4;
        int Friday = 5;
        int Saturday = 6;
        int Sunday = 7;
        switch (DayOfWeek)
        {
            case 1: Console.WriteLine ("Monday"); break;
            case 2: Console.WriteLine("Tuesday"); break;
            case 3: Console.WriteLine("Wensday"); break;
            case 4: Console.WriteLine("Thursday"); break;
            case 5: Console.WriteLine("Friday");break;
            case 6: Console.WriteLine("Satuday");break; 
            case 7: Console.WriteLine("Sunday");break; 



6 -> да
7 -> да
1 -> нет


Задача 16   Написать программму, которая принимает X и Y
         Причем X!= 0 и Y!=0 и выдвает номер четверти плоскости
        в которой находится эта точка.

        CODE

        int x = Convert.ToInt32(Console.ReadLine());
        int y = Convert.ToInt32(Console.ReadLine());
        if (x > 0 && y > 0)
        {
            Console.WriteLine("First");
        }
        else if (x<0 && y> 0)
        {
            Console.WriteLine("Second");
        }
        else if ( x<0 && y<0) 
        {
            Console.WriteLine("Third");
           
        }
        else
        {
            Console.WriteLine("Fourth");
        }


         /* ЗАДАЧА 21 Напишите программу, которая принимает на вход 
         * Координат двух точек и находит рассояние между ними в 2д
         * пространстве
         * А(3,6); В(2,1) > 5.09
         * A(7.5);B(1.-1)>7.21  */

         CODE

        Console.Write("Enter x1 ");
        double x1 = Convert.ToDouble(Console.ReadLine());
        Console.Write("Enter y1 ");
        double y1 = Convert.ToDouble(Console.ReadLine());
        Console.Write("Enter x2 ");
        double x2 = Convert.ToDouble(Console.ReadLine());
        Console.Write("Enter y2 ");
        double y2 = Convert.ToDouble(Console.ReadLine());

        double distance = Math.Sqrt(Math.Pow((x1 - y1), 2) + Math.Pow((x2 - y2), 2));
        Console.WriteLine(distance);



        /* ЗАДАЧА 22 Написать программу, которая принимает число 
         * N и выдает таблицу квадратов от чисел от 1 до N
         * 5 - 1.4.9.16.25
         * 2-1.4*/

         Console.WriteLine("Enter number: ");
        int num1 = int.Parse(Console.ReadLine());
        for (int i = 0; i<=num1; i++)
        {
            
            Console.Write(Math.Pow(i,2)  +" ");
        }


